{
    "portfolio": [
      {
        "id": "1",
        "name": "Page produit",
        "description": "Ce site web est un concept de page produit que j'ai réalisé dans le cadre d'un concours organisé par un youtuber. J'ai donc créé cette page en m'inspirant d'un design déjà existant auquel j'ai ajouté un menu burger ainsi qu'un mode sombre. Cette page est réalisée en HTML, Css et Vanilla js.",
        "website_link": "https://evanchauffour.github.io/Concours-Product-page/",
        "images": {
          "desktop": [
            "/projectsImg/productLight.svg",
            "/projectsImg/productPageDark.svg"
          ],
          "mobile": [
          ]
        },
        "technologies": [
            {
              "img": "https://img.icons8.com/color/48/html-5--v1.png",
              "label": "HTML"
            },
            {
              "img": "https://img.icons8.com/color/48/css3.png",
              "label": "CSS"
            },
            {
              "img": "https://img.icons8.com/color/48/javascript--v1.png",
              "label": "JavaScript"
            }
        ]
      },
      {
        "id": "2",
        "name": "Patricia Revollat",
        "description": "J'ai eu l'opportunité de concevoir un site web personnel pour une kinésiologue magnétiseur. Ce projet a été réalisé en utilisant WordPress pour créer une vitrine en ligne attrayante et informative. Le site comprend des sections informatives essentielles, notamment une présentation détaillée de la kinésiologue magnétiseur, son approche, ses méthodes, les services proposés... Pour dynamiser l'expérience utilisateur, j'ai intégré des animations subtiles à l'aide de JavaScript. Ces animations ajoutent une touche d'interactivité au site tout en maintenant une ambiance professionnelle. Enfin, un formulaire de contact personnalisé a été inclus pour faciliter la communication entre la kinésiologue magnétiseur et les visiteurs du site. Cela permet aux clients potentiels de poser des questions, de demander des informations complémentaires ou de prendre rendez-vous directement.",
        "website_link": "https://patriciarevollat.fr/",
        "images": {
          "desktop": [
            "/projectsImg/patricia1.svg",
            "/projectsImg/patricia2.svg",
            "path/project2-image3-desktop.jpg"
          ],
          "mobile": [
            "/projectsImg/patriciaMobile1.svg",
            "/projectsImg/patriciaMobile2.svg",
            "/projectsImg/patriciaMobile3.svg"
          ]
        },
        "technologies": [
          {
            "label": "WordPress",
            "img":"/wordpress.svg"
          }
        ]
      },
      {
        "id": "3",
        "name": "Lucile Marjollet",
        "description": "J'ai réalisé un site vitrine sous WordPress pour une psychopraticienne relationnelle, un projet personnel visant à présenter son activité de manière professionnelle et attrayante. Le site est basé sur WordPress pour sa facilité d'utilisation et sa gestion de contenu, permettant ainsi à la psychopraticienne de mettre à jour le contenu elle-même. J'ai intégré des animations JavaScript pour donner vie au site, renforçant ainsi son attrait visuel tout en maintenant un environnement calme et professionnel. Ce projet a permis de créer une présence en ligne engageante et professionnelle pour la psychopraticienne, en mettant en valeur son expertise tout en captivant l'attention des visiteurs grâce aux animations subtiles.",
        "website_link": "https://lucilemarjollet.com/",
        "images": {
          "desktop": [
            "/projectsImg/lucile1.svg",
            "/projectsImg/lucile2.svg",
            "path/project2-image3-desktop.jpg"
          ],
          "mobile": [
            "/projectsImg/lucileMobile1.svg",
            "/projectsImg/lucileMobile2.svg",
            "/projectsImg/lucileMobile3.svg"
          ]
        },
        "technologies": [
          {
            "label": "WordPress",
            "img":"/wordpress.svg"
          }
        ]
      },
      {
        "id": "4",
        "name": "ShareSpend",
        "description": "ShareSpend est une application mobile que je développe actuellement en utilisant React Native pendant mon temps libre. Elle simplifie le suivi et la gestion des dépenses partagées entre amis, familles ou collègues. Avec une interface conviviale, ShareSpend rend la gestion financière facile et efficace. Une fois terminée, elle sera peut-être disponible sur les plateformes de téléchargement, concrétisant ainsi mon projet de A à Z.",
        "images": {
          "desktop": [
          ],
          "mobile": [
            "/projectsImg/sharespend1.svg",
            "/projectsImg/sharespend2.svg",
            "/projectsImg/sharespend3.svg",
            "/projectsImg/sharespend4.svg"
          ]
        },
        "technologies": [
          {
            "label": "React Native",
            "img":"/reactNative.svg"
          },
          {
            "label": "NodeJs",
            "img":"/nodejs.svg"
          },
          {
            "label": "MongoDb",
            "img":"/mongodb.svg"
          }
        ]
      }
    ]
  }
  