{
    "portfolio": [
      {
        "id": "1",
        "name": "Page produit",
        "description": "Ce site web est un concept de page produit que j'ai réalisé dans le cadre d'un concours organisé par un youtuber. J'ai donc créé cette page en m'inspirant d'un design déjà existant auquel j'ai ajouté un menu burger ainsi qu'un mode sombre. Cette page est réalisée en HTML, Css et Vanilla js.",
        "website_link": "https://evanchauffour.github.io/Concours-Product-page/",
        "github_link": "https://github.com/Evanchauffour/Concours-Product-page",
        "images": {
          "desktop": [
            "/pageProduct.webm"
          ]
        },
        "technologies": [
            {
              "img": "https://img.icons8.com/color/48/html-5--v1.png",
              "label": "HTML"
            },
            {
              "img": "https://img.icons8.com/color/48/css3.png",
              "label": "CSS"
            },
            {
              "img": "https://img.icons8.com/color/48/javascript--v1.png",
              "label": "JavaScript"
            }
        ]
      },
      {
        "id": "2",
        "name": "Patricia Revollat",
        "description": "J'ai eu l'opportunité de concevoir un site web personnel pour une kinésiologue magnétiseur. Ce projet a été réalisé en utilisant WordPress pour créer une vitrine en ligne attrayante et informative. Le site comprend des sections informatives essentielles, notamment une présentation détaillée de la kinésiologue magnétiseur, son approche, ses méthodes, les services proposés... Pour dynamiser l'expérience utilisateur, j'ai intégré des animations subtiles à l'aide de JavaScript. Ces animations ajoutent une touche d'interactivité au site tout en maintenant une ambiance professionnelle. Enfin, un formulaire de contact personnalisé a été inclus pour faciliter la communication entre la kinésiologue magnétiseur et les visiteurs du site. Cela permet aux clients potentiels de poser des questions, de demander des informations complémentaires ou de prendre rendez-vous directement.",
        "website_link": "https://patriciarevollat.fr/",
        "images": {
          "desktop": [
            "/patricia.webm"
          ],
          "mobile": [
            "/patriciaMobile.webm"
          ]
        },
        "technologies": [
          {
            "label": "WordPress",
            "img":"/wordpress.svg"
          },
          {
            "img": "https://img.icons8.com/color/48/css3.png",
            "label": "CSS"
          },
          {
            "img": "https://img.icons8.com/color/48/javascript--v1.png",
            "label": "JavaScript"
          }
        ]
      },
      {
        "id": "3",
        "name": "Lucile Marjollet",
        "description": "J'ai réalisé un site vitrine sous WordPress pour une psychopraticienne relationnelle, un projet personnel visant à présenter son activité de manière professionnelle et attrayante. Le site est basé sur WordPress pour sa facilité d'utilisation et sa gestion de contenu, permettant ainsi à la psychopraticienne de mettre à jour le contenu elle-même. J'ai intégré des animations JavaScript pour donner vie au site, renforçant ainsi son attrait visuel tout en maintenant un environnement calme et professionnel. Ce projet a permis de créer une présence en ligne engageante et professionnelle pour la psychopraticienne, en mettant en valeur son expertise tout en captivant l'attention des visiteurs grâce aux animations subtiles.",
        "website_link": "https://lucilemarjollet.com/",
        "images": {
          "desktop": [
            "/lucile.webm"
          ],
          "mobile": [
            "/lucileMobile.webm"
          ]
        },
        "technologies": [
          {
            "label": "WordPress",
            "img":"/wordpress.svg"
          },
          {
            "img": "https://img.icons8.com/color/48/css3.png",
            "label": "CSS"
          },
          {
            "img": "https://img.icons8.com/color/48/javascript--v1.png",
            "label": "JavaScript"
          }
        ]
      },
      {
        "id": "4",
        "name": "ShareSpend",
        "description": "ShareSpend est une application mobile que je développe actuellement en utilisant React Native pendant mon temps libre. Elle simplifie le suivi et la gestion des dépenses partagées entre amis, familles ou collègues. Avec une interface conviviale, ShareSpend rend la gestion financière facile et efficace. Une fois terminée, elle sera peut-être disponible sur les plateformes de téléchargement, concrétisant ainsi mon projet de A à Z.",
        "images": {
          "mobile": [
            "/sharespendCompressed.webm"
          ]
        },
        "github_link": "https://github.com/Evanchauffour/front-ShareSpend",
        "technologies": [
          {
            "label": "React Native",
            "img":"/reactNative.svg"
          },
          {
            "label": "Tailwind",
            "img":"/tailwind.svg"
          },
          {
            "label": "NodeJs",
            "img":"/nodejs.svg"
          },
          {
            "label": "Express",
            "img":"/express.svg"
          },
          {
            "label": "MongoDb",
            "img":"/mongodb.svg"
          }
        ]
      },
      {
        "id": "5",
        "name": "Serre connectée",
        "description": "La serre connectée est un projet réalisé dans le cadre de mes études. Le but était de concevoir une serre connectée via Arduino, pouvant être pilotée à distance. Dans ce projet, j'ai développé l'application de contrôle de la serre. Pour récupérer les données de la serre, j'ai utilisé un serveur Node.js dans lequel j'ai intégré la bibliothèque Socket.io afin d'envoyer les données en temps réel au frontend de l'application grâce aux WebSockets. Pour l'interface, j'ai utilisé Next.js ainsi que la bibliothèque Socket.io pour récupérer les données de la serre.",
        "images": {
          "desktop": [
            "/serre.webm"
          ]
        },
        "github_link": "https://github.com/Evanchauffour/Serre",
        "technologies": [
          {
            "label": "NextJs",
            "img":"/nextjs.svg"
          },
          {
            "label": "Tailwind",
            "img":"/tailwind.svg"
          },
          {
            "label": "NodeJs",
            "img":"/nodejs.svg"
          },
          {
            "label": "Socket.io",
            "img":"/socketio.svg"
          }
        ]
      },
      {
        "id": "6",
        "name": "le clos montagny",
        "description": "J'ai eu l'opportunité de travailler sur un projet scolaire intitulé 'Le Clos Montagny', réalisé sur deux semaines : une semaine de design et une semaine de développement, dont je me suis chargé. Notre cliente souhaitait un site web qui lui ressemble pour présenter ses trois gîtes. Nous avons utilisé WordPress pour ce projet afin de permettre à notre cliente de modifier son contenu comme elle le souhaite et de faire évoluer le site. Le site comprend une présentation détaillée des trois gîtes, mettant en avant leurs caractéristiques uniques et les services offerts. Nous avons également intégré des images attrayantes et des descriptions détaillées pour chaque gîte, afin de fournir aux visiteurs toutes les informations nécessaires pour faire un choix éclairé. Pour améliorer l'expérience utilisateur, nous avons inclus des animations subtiles à l'aide de JavaScript, ajoutant une touche d'interactivité tout en maintenant une ambiance conviviale et professionnelle. Enfin, un formulaire de contact personnalisé a été ajouté pour faciliter la communication entre notre cliente et les visiteurs du site, permettant aux clients potentiels de poser des questions, de demander des informations complémentaires ou de réserver un séjour directement.",
        "images": {
          "desktop": [
            "/clos.webm"
          ],
          "mobile": [
            "/closMobile.webm"
          ]
        },
        "website_link": "https://leclosmontagny.fr/",
        "github_link": "https://github.com/Evanchauffour/leclosmontagny",
        "technologies": [
          {
            "label": "WordPress",
            "img":"/wordpress.svg"
          },
          {
            "img": "https://img.icons8.com/color/48/css3.png",
            "label": "CSS"
          },
          {
            "img": "https://img.icons8.com/color/48/javascript--v1.png",
            "label": "JavaScript"
          }
        ]
      },
      {
        "id": "7",
        "name": "Fiche utilisateur",
        "description": "J'ai eu l'opportunité de travailler sur un projet de fiche utilisateur pour l'ENT Facile Éducation dans le cadre de mon alternance chez WeProde. Ce projet a été réalisé en deux étapes distinctes : le développement du frontend et les tests end-to-end (E2E). Pour le développement du frontend, j'ai utilisé Vue.js pour créer une interface utilisateur interactive et réactive. Cette interface permet de consulter les informations d'un utilisateur. Par exemple, pour un enseignant, la fiche utilisateur affiche ses informations de contact, les cours qu'il dispense, les classes qu'il encadre, et le cours actuellement en session. Pendant cette phase, j'ai régulièrement interagi avec le backend, développé en Java, en utilisant des API REST pour récupérer et envoyer les données nécessaires. Ensuite, j'ai effectué des tests end-to-end avec Cypress. Ces tests ont permis de s'assurer que toutes les fonctionnalités de la fiche utilisateur fonctionnaient correctement et offraient une expérience utilisateur fluide et sans erreurs. Les tests E2E sont cruciaux pour identifier et résoudre les problèmes potentiels avant la mise en production, garantissant ainsi la fiabilité et la robustesse de l'application. Ce projet m'a permis de développer mes compétences en développement frontend avec Vue.js et en tests automatisés avec Cypress, tout en me donnant l'occasion de travailler sur une application ayant un impact direct sur la communauté éducative.",
        "images": {
          "desktop": [
            "/userCard.webm"
          ]
        },
        "technologies": [
          {
            "label": "VueJs",
            "img":"/vuejs.svg"
          },
          {
            "img": "/cypress.svg",
            "label": "Cypress"
          }
        ]
      },
      {
        "id": "8",
        "name": "Carnet de liaison",
        "description": "J'ai eu l'opportunité de travailler sur un projet de carnet de liaison pour l'ENT Facile Éducation dans le cadre de mon alternance chez WeProde. Ce projet permet à l'établissement scolaire d'écrire des mots dans le carnet des élèves ou de gérer des autorisations de sortie, par exemple, afin de faire signer les parents. Le projet a été réalisé en deux étapes distinctes : le développement du frontend et les tests end-to-end (E2E). Pour le développement du frontend, j'ai utilisé Vue.js pour créer une interface utilisateur conviviale et intuitive. Cette interface permet aux enseignants et au personnel administratif de facilement ajouter et consulter des notes dans le carnet de liaison des élèves. Les parents peuvent également accéder à ces informations et fournir les signatures nécessaires pour les autorisations de sortie. Pendant cette phase, j'ai régulièrement interagi avec le backend, développé en Java, en utilisant des API REST. J'ai parfois dû modifier certaines méthodes backend pour m'adapter aux exigences spécifiques du développement frontend. Ensuite, j'ai effectué des tests end-to-end avec Cypress. Ces tests ont permis de s'assurer que toutes les fonctionnalités du carnet de liaison fonctionnaient correctement et offraient une expérience utilisateur fluide et sans erreurs. Les tests E2E sont essentiels pour identifier et résoudre les problèmes potentiels avant la mise en production, garantissant ainsi la fiabilité et la robustesse de l'application.",
        "images": {
          "desktop": [
            "/logbook.webm"
          ]
        },
        "technologies": [
          {
            "label": "VueJs",
            "img":"/vuejs.svg"
          },
          {
            "img": "/cypress.svg",
            "label": "Cypress"
          },
          {
            "label": "Java",
            "img":"https://img.icons8.com/color/48/java-coffee-cup-logo--v1.png"
          }
        ]
      },
      {
        "id": "9",
        "name": "Vie scolaire",
        "description": "J'ai eu l'opportunité de travailler sur un projet de service de vie scolaire pour l'ENT Facile Éducation dans le cadre de mon alternance chez WeProde. Ce projet permet de regrouper l'ensemble des informations concernant un élève, telles que les retards et les absences, afin de faciliter la gestion de la vie scolaire au sein de l'établissement. Les parents peuvent également utiliser ce service pour justifier les absences de leurs enfants. Le projet a été réalisé en deux étapes distinctes : le développement du frontend et les tests end-to-end (E2E). Pour le développement du frontend, j'ai utilisé Vue.js pour créer une interface utilisateur intuitive et facile à utiliser. Cette interface permet au personnel de la vie scolaire de consulter et de gérer les informations relatives aux retards et aux absences des élèves. Les parents peuvent également accéder à cette interface pour justifier les absences de leurs enfants. Pendant cette phase, j'ai régulièrement interagi avec le backend, développé en Java, en utilisant des API REST. J'ai parfois dû modifier certaines méthodes backend pour m'adapter aux exigences spécifiques du développement frontend. Ensuite, j'ai effectué des tests end-to-end avec Cypress. Ces tests ont permis de s'assurer que toutes les fonctionnalités du service de vie scolaire fonctionnaient correctement et offraient une expérience utilisateur fluide et sans erreurs. Les tests E2E sont essentiels pour identifier et résoudre les problèmes potentiels avant la mise en production, garantissant ainsi la fiabilité et la robustesse de l'application.",
        "images": {
          "desktop": [
            "/schoolLife.webm"
          ]
        },
        "technologies": [
          {
            "label": "VueJs",
            "img":"/vuejs.svg"
          },
          {
            "img": "/cypress.svg",
            "label": "Cypress"
          },
          {
            "label": "Java",
            "img":"https://img.icons8.com/color/48/java-coffee-cup-logo--v1.png"
          }
        ]
      }
    ]
  }
  